Финансы/src/DataProcessors/СервисПроверкиЧеков/СервисПроверкиЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СервисПроверкиЧеков</name>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Финансы/src/DataProcessors/СервисПроверкиЧеков/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ХранилищеЗначения = ХранилищеОбщихНастроек.Загрузить("СервисПроверкиЧеков", "Параметры");
	
	Если ТипЗнч(ХранилищеЗначения) = тип("ХранилищеЗначения") Тогда
		
		СтруктураПараметров = ХранилищеЗначения.Получить();
		ЗаполнитьЗначенияСвойств(Объект, СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Регистрация(Команда)

	СтруктураДанных = Новый Структура("email,name,phone",Объект.email, Объект.Имя, Объект.Телефон);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	//https://proverkacheka.nalog.ru:9999/v1/mobile/users/signup
	//Content-Type: application/json; charset=UTF-8

	Хост = "proverkacheka.nalog.ru";
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);		
	Соединение = Новый HTTPСоединение(Хост, 9999, Объект.Телефон, Объект.Пароль, ,30, SSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8");
	Заголовки.Вставить("Content-Charset", "utf-8");		
	Заголовки.Вставить("Device-Id", "windows-pc");
	Заголовки.Вставить("device-os", "windows");
	
	HTTPЗапрос = Новый HTTPЗапрос("/v1/mobile/users/signup", Заголовки);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстJSON,  КодировкаТекста.UTF8);
	
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 204 Тогда
		Сообщить("Запрос отправлен. Ожидайте СМС на телефон.");
	Иначе
		Сообщить("Код состояния: " + HTTPОтвет.КодСостояния);
		Сообщить("Текст ответа: " + HTTPОтвет.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановлениеПароля(Команда)
	
	СтруктураДанных = Новый Структура("phone", Объект.Телефон);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	//https://proverkacheka.nalog.ru:9999/v1/mobile/users/restore
	//Content-Type: application/json; charset=UTF-8

	Хост = "proverkacheka.nalog.ru";
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);		
	Соединение = Новый HTTPСоединение(Хост, 9999, Объект.Телефон, Объект.Пароль, ,30, SSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8");
	Заголовки.Вставить("Content-Charset", "utf-8");		
	Заголовки.Вставить("Device-Id", "windows-pc");
	Заголовки.Вставить("device-os", "windows");
	
	HTTPЗапрос = Новый HTTPЗапрос("/v1/mobile/users/restore", Заголовки);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстJSON,  КодировкаТекста.UTF8);
	
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 204 Тогда
		Сообщить("Запрос отправлен. Ожидайте СМС на телефон.");
	Иначе
		Сообщить("Код состояния: " + HTTPОтвет.КодСостояния);
		Сообщить("Текст ответа: " + HTTPОтвет.ПолучитьТелоКакСтроку());
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	СтруктураПараметров = Новый Структура("email,Телефон,Имя,Пароль");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Объект);
	
	ХранилищеОбщихНастроек.Сохранить("СервисПроверкиЧеков", "Параметры", Новый ХранилищеЗначения(СтруктураПараметров)); 
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНаСервере();
	
КонецПроцедуры
